Velocify

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="https://service.leads360.com">
    <env:Body>
	<ser:AddLeads>
	    <ser:username><%= @credentials[:username] %></ser:username>
	    <ser:password><%= @credentials[:password] %></ser:password>
	    <ser:leads>
		<Leads>
		    <% @leads.each do |lead| %>
			<Lead>
			    <% if lead.status_id? %>
				<Status StatusId="<%= lead.status_id %>"></Status>
			    <% end %>
			    <% if lead.campaign_id? %>
				<Campaign CampaignId="<%= lead.campaign_id %>"></Campaign>
			    <% end %>
			    <% if lead.agent_id? %>
				<Agent AgentId="<%= lead.agent_id %>"></Agent>
			    <% end %>
			    <% unless lead.fields.empty? %>
				<Fields>
				    <% lead.fields.each do |field| %>
					<Field FieldId="<%= field[:id] %>" Value="<%= field[:value] %>"></Field>
				    <% end %>
				</Fields>
			    <% end %>
			</Lead>
		    <% end %>
		</Leads>
	    </ser:leads>
	</ser:AddLeads>
    </env:Body>
</env:Envelope>
